{
  "sources": [
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news",
      "articles": [
        {
          "id": "618deac811d3cb08287a4ba3",
          "author": null,
          "description": "We are often in a hurry to commit our changes in Git and so we write something random in our commit messages. In fact, I have seen people putting the date and time or even something like commit 1, commit 2 in their messages.  This is not a good practice,",
          "link": "https://www.freecodecamp.org/news/how-to-use-commitlint-to-write-good-commit-messages/",
          "publishedOn": "2021-11-12T20:11:06.000Z",
          "wordCount": 1917,
          "title": "How to Write Good Commit Messages with Commitlint"
        },
        {
          "id": "618e136011d3cb08287a4c71",
          "author": null,
          "description": "When you're using your Windows machine, your WiFi might unexpectedly disconnect.  This might be caused by various problems such as an outdated network adapter driver, outdated router software, and optimized power management in Windows 10.  If your WiFi keeps disconnecting and you're looking for a solution, you've come to the",
          "link": "https://www.freecodecamp.org/news/why-does-my-wifi-keep-disconnecting-solved-on-windows-10-pc/",
          "publishedOn": "2021-11-12T17:47:24.000Z",
          "wordCount": 635,
          "title": "Why Does my WiFi Keep Disconnecting? [Solved on Windows 10 PC]"
        },
        {
          "id": "618b035411d3cb08287a3f7d",
          "author": null,
          "description": "Hey, how are you doing? In this article, I'm going to show you how you can install Laravel 8 on your phone.  To get the most out of this guide, you should have some knowledge of PHP and you should know what Laravel is. But if you don't, don't worry",
          "link": "https://www.freecodecamp.org/news/how-to-setup-laravel-8-on-android-phone/",
          "publishedOn": "2021-11-11T16:34:04.000Z",
          "wordCount": 946,
          "title": "How to Set Up Laravel 8 on Your Android Phone"
        },
        {
          "id": "618ca60511d3cb08287a474b",
          "author": null,
          "description": "In JavaScript, hoisting allows you to use functions and variables before they're declared. In this post, we'll learn what hoisting is and how it works. What is hoisting?Take a look at the code below and guess what happens when it runs: console.log(foo); var foo = 'foo'; It might",
          "link": "https://www.freecodecamp.org/news/what-is-hoisting-in-javascript/",
          "publishedOn": "2021-11-11T16:12:59.000Z",
          "wordCount": 1533,
          "title": "What is Hoisting in JavaScript?"
        },
        {
          "id": "618a1b968bcfae07ca4e3a16",
          "author": null,
          "description": "These days, developers need to develop, ship, and run applications quicker than ever. And fortunately, there's a tool that helps you do that – Docker. With Docker, you can now easily ship, test, and deploy your code quickly while maintaining full control over your infrastructure. It significantly reduces how long it",
          "link": "https://www.freecodecamp.org/news/how-to-dockerize-a-flask-app/",
          "publishedOn": "2021-11-11T16:04:40.000Z",
          "wordCount": 1490,
          "title": "How to Dockerize a Flask Application"
        },
        {
          "id": "6189613e8bcfae07ca4e3967",
          "author": null,
          "description": "Computers have revolutionized our lives.  They help us get repetitive tasks done quickly and accurately. And they are tireless and do not fear complexity.  Computers are able to process data and perform operations at a rate of millions per second. They can get a task done much faster compared to",
          "link": "https://www.freecodecamp.org/news/what-is-a-pc-computer-definition-and-computer-basics-for-beginners/",
          "publishedOn": "2021-11-10T18:35:08.000Z",
          "wordCount": 2087,
          "title": "What is a PC? Computer Definition and Computer Basics for Beginners"
        },
        {
          "id": "618bf06d11d3cb08287a4450",
          "author": null,
          "description": "If you use Windows 10, you might have encountered the error \"no audio output device is installed\".    This error can be caused by a corrupt driver, overdue updates, or improper connection.  In this article, I will show you 2 ways you can fix the \"no audio output",
          "link": "https://www.freecodecamp.org/news/no-audio-output-device-is-installed-fixed-on-windows-10-pc/",
          "publishedOn": "2021-11-10T18:27:53.000Z",
          "wordCount": 547,
          "title": "No Audio Output Device is Installed [Fixed on Windows 10 PC]"
        },
        {
          "id": "615eb0160d91c9077974e918",
          "author": null,
          "description": "When you're working with Python strings, there are times when you'll have to reverse them, and work with their reversed copies instead.  But since Python strings are immutable, you cannot modify or reverse them in place. In Python, there are a few different ways you can do this. And this",
          "link": "https://www.freecodecamp.org/news/python-reverse-string-string-reversal-in-python-explained-with-code-examples/",
          "publishedOn": "2021-11-10T16:40:09.000Z",
          "wordCount": 1622,
          "title": "Python Reverse String – String Reversal in Python Explained with Examples"
        },
        {
          "id": "61695ddc80d82d07c45a5220",
          "author": null,
          "description": "The destructuring assignment in JavaScript provides a neat and DRY way to extract values from your arrays and objects. This article aims to show you exactly how array and object destructuring assignments work in JavaScript. So, without any further ado, let’s get started with array destructuring. What Is Array",
          "link": "https://www.freecodecamp.org/news/array-vs-object-destructuring-in-javascript/",
          "publishedOn": "2021-11-10T16:24:16.000Z",
          "wordCount": 3359,
          "title": "Array vs Object Destructuring in JavaScript – What’s the Difference?"
        },
        {
          "id": "618671f48bcfae07ca4e299e",
          "author": null,
          "description": "Hey everyone, in this tutorial we'll use React with Firebase V9 to setup authentication for an application.  We will create Firebase functions for Login and Register, we will add toast messages for errors, and we will add private routes using session-based authentication. It's going to be fun. We will use",
          "link": "https://www.freecodecamp.org/news/react-firebase-authentication-and-crud-operations/",
          "publishedOn": "2021-11-10T16:22:43.000Z",
          "wordCount": 3348,
          "title": "React Authentication Tutorial – How to Set Up Auth with Firebase V9 and React Router V6"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}